apps/backend/tests/performance/admin/artillery-admin.yml
# Artillery Load Test - Admin Module
# Usage (smoke/default): npx artillery run tests/performance/admin/artillery-admin.yml
# Usage (full):          npx artillery run --environment full tests/performance/admin/artillery-admin.yml

config:
  target: "http://localhost:5000"
  http:
    timeout: 60

  phases:
    - duration: 5
      arrivalCount: 1
      name: "Smoke"

  environments:
    full:
      phases:
        - duration: 30
          arrivalRate: 2
          name: "Warm up"
        - duration: 60
          arrivalRate: 6
          name: "Ramp up"
        - duration: 90
          arrivalRate: 10
          name: "Peak"

scenarios:
  - name: "Admin Overview & Users"
    flow:
      # Register Admin staff and capture token
      - post:
          url: "/api/auth/staff/register"
          json:
            fullName: "Admin Perf User"
            email: "perf.admin.module.{{ $timestamp }}.{{ $randomNumber(1, 1000000) }}@example.com"
            contactNumber: "0771234567"
            role: "Admin"
            password: "AdminPassword123!"
          capture:
            - json: "$.data.token"
              as: "adminToken"
          expect:
            - statusCode: 201

      - get:
          url: "/api/admin/overview"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: 200

      - get:
          url: "/api/admin/users?role=Admin"
          headers:
            Authorization: "Bearer {{ adminToken }}"
          expect:
            - statusCode: 200